
import java.util.Arrays;
import java.util.LinkedList;
import java.util.List;


// Съдържа всички списъци с думи, които трябва да се разгадаят

public class Dictionaries {
    public static String selectedCategory;


    public static List<String> countries = new LinkedList<String>(Arrays.asList(
            "Китай", "Индия", "САЩ", "Индонезия", "Бразилия", "Пакистан", "Нигерия", "Бангладеш", "Русия", "Япония", "Мексико", "Филипини", "Етиопия", "Виетнам", "Египет", "Иран", "Германия",
            "Турция", "Демократична република Конго", "Тайланд", "Франция", "Великобритания", "Италия", "РЮА", "Мианмар", "Танзания", "Южна Корея", "Колумбия", "Испания", "Кения", "Украйна", "Аржентина",
            "Алжир", "Уганда", "Полша", "Ирак", "Судан", "Канада", "Мароко", "Афганистан", "Непал", "Саудитска Арабия", "Малайзия", "Перу", "Венецуела", "Узбекистан", "Мозамбик", "Гана", "Йемен", "Ангола",
            "Северна Корея", "Австралия", "Мадагаскар", "Тайван", "Камерун", "Шри Ланка", "Румъния", "Сирия", "Казахстан", "Буркина Фасо", "Нигер", "Чили", "Малави", "Мали", "Нидерландия", "Замбия", "Еквадор",
            "Камбоджа", "Зимбабве", "Гватемала", "Сенегал", "Южен Судан", "Гвинея", "Руанда", "Чад", "Белгия", "Бурунди", "Тунис", "Куба", "Бенин", "Гърция", "Боливия", "Сомалия", "Хаити", "Чехия",
            "Доминиканска република", "Португалия", "Унгария", "Швеция", "Азербайджан", "Беларус", "Обединени Арабски Емирства", "Австрия", "Швейцария", "Таджикистан", "Хондурас", "Израел", "Йордания", "Хонконг",
            "България", "Сърбия", "Лаос", "Парагвай", "Папуа Нова Гвинея", "Еритрея", "Либия", "Ливан", "Салвадор", "Никарагуа", "Сиера Леоне", "Сингапур", "Киргизстан", "Дания", "Финландия", "Словакия", "Туркменистан",
            "Норвегия", "Централно африканска република", "Коста Рика", "Нова Зеландия", "Ирландия", "Република Конго", "Палестина", "Оман", "Хърватия", "Либерия", "Кувейт", "Босна и Херцеговина", "Грузия", "Панама",
            "Мавритания", "Молдова", "Пуерто Рико", "Уругвай", "Армения", "Монголия", "Ямайка", "Литва", "Албания", "Намибия", "Ботсвана", "Катар", "Лесото", "Република Македония", "Словения", "Латвия", "Гамбия",
            "Косово", "Гвинея Бисау", "Габон", "Бахрейн", "Тринидад и Тобаго", "Мавриций", "Естония", "Свазиленд", "Източен Тимор", "Фиджи", "Кипър", "Реюнион", "Джибути", "Коморски острови", "Бутан", "Екваториална Гвинея",
            "Гвиана", "Макао", "Соломонови острови", "Черна гора", "Суринам", "Люксембург", "Кабо Верде", "Бруней", "Малта", "Гваделупа", "Малдиви", "Мартиника", "Белиз", "Исландия", "Бахамски острови",
            "Нидерландски Антили", "Барбадос", "Френска Полинезия", "Вануату", "Нова Каледония", "Френска Гвиана", "Майот", "Самоа", "Сао Томе и Принсипи", "Сейнт Лусия", "Гуам", "Аруба", "Гренада", "Тонга", "Кирибати",
            "Микронезия", "Американски Вирджински острови", "Сейнт Винсънт и Гренадини", "Джърси", "Антигуа и Барбуда", "Сейшелски острови", "Ман", "Андора", "Доминика", "Маршалови острови", "Бермудски острови", "Гърнси",
            "Кайманови острови", "Гренландия", "Американска Самоа", "Северни Мариански острови", "Сейнт Китс и Невис", "Търкси Кайкос", "Фарьорски острови", "Сен Мартен", "Монако", "Лихтенщайн", "Британски Вирджински острови",
            "Сан Марино", "Гибралтар", "Палау", "Ангуила", "Уолиси Футуна", "Острови Кук", "Тувалу", "Науру", "Света Елена", "Сен Бартелми", "Сен Пиер и Микелон", "Монсерат", "Фолклендски острови", "Ниуе", "Токелау",
            "Ватикан", "Питкерн"));

    public static List<String> cities = new LinkedList<String>(Arrays.asList(
            "Пловдив", "Бургас", "Стара Загора", "Добрич", "Шумен", "Пазарджик", "Хасково", "Велико Търново", "Габрово", "Видин", "Кърджали", "Монтана", "Димитровград", "Ловеч", "Разград", "Свищов",
            "Смолян", "Самоков", "Севлиево", "Нова Загора", "Айтос", "Ботевград", "Пещера", "Свиленград", "Панагюрище", "Попово", "Радомир", "Нови Искър", "Несебър", "Козлодуй", "Нови пазар", "Раднево",
            "Разлог", "Бяла Слатина", "Костинброд", "Стамболийски", "Кнежа", "Павликени", "Елхово", "Луковит", "Трявна", "Средец", "Сопот", "Велики Преслав", "Ракитово", "Кричим", "Септември",
            "Банско", "Аксаково", "Своге", "Любимец", "Пирдоп", "Симитли", "Златоград", "Дулово", "Симеоновград", "Тервел", "Девин", "Стралджа", "Вършец", "Куклен", "Котел", "Елена", "Якоруда",
            "Тополовград", "Стражица", "Чепеларе", "Перущица", "Златица", "Долна баня", "Ветово", "Тръстеник", "Долни Дъбник", "Годеч", "Игнатиево", "Брацигово", "Стрелча", "Свети Влас", "Брезник",
            "Ардино", "Никопол", "Белово", "Мартен", "Кресна", "Рудозем", "Приморско", "Летница", "Искър", "Гулянци", "Крън", "Сливо поле", "Драгоман", "Батак", "Завет", "Мизия", "Каспичан", "Николаево",
            "Гурково", "Калофер", "Априлци", "Долна Оряховица", "Ябланица", "Опака", "Златарица", "Добринище", "Бяла черква", "Брегово", "Садово", "Лъки", "Доспат", "Кочериново", "Бяла", "Черноморец",
            "Пордим", "Сухиндол", "Брезово", "Каолиново", "Меричлери", "Плачковци", "Момин проход", "Грамада", "Бойчиновци", "Ахтопол", "Шипка", "Димово", "Китен", "Плиска"));


    public static List<String> rivers = new LinkedList<String>(Arrays.asList(
            "Нил", "Амазонка", "Яндзъ", "Мисисипи", "Енисей", "Амур", "Хуанхъ", "Меконг", "Конго", "Амур", "Лена", "Иртиш", "Маккензи", "Нигер", "Мисури", "Енисей", "Парана", "Об", "Маккензи",
            "Волга", "Рио Пурус", "Юкон", "РиоГранде", "Долна Тунгуска", "Брахмапутра", "Сау Франсиску", "Дунав", "Амур", "Дарлинг", "Ефрат", "Замбези", "Ганг", "Токантинс", "Рио Арагвая", "Мъри", "Нелсън", "Юкон",
            "Парагвай", "Амударя", "Колима", "Салуин", "Вилюй", "Урал", "Колорадо", "Арканзас", "Алдан", "Днепър", "Сърдаря", "Оленек", "Ориноко", "Иравади", "Рио Саладо", "Рио Тапажос", "Рио Шингу", "Витим",
            "Колумбия", "Маккензи", "Тигър", "Дон", "Оранжева река", "Ангара", "Подкаменная Тунгуска", "Печора", "Кама", "Окаванго", "Индигирка", "Охайо", "Негро", "Пийс", "Кура", "Ока", "Селенга", "Мадейра",
            "Олекма", "Белая", "Или", " ", "Днестър", "Рейн", "Керулен", "Атабаска", "Елба", "Анадир", "Катанга", "Гамбия", "Тахо", "Йелоустоун", "Висла", "Котуй", "Лоара"));


    public static List<String> selection(String strSelect, List<String> lstSecretWord) {
        String steChoice = String.valueOf(strSelect.toLowerCase());
        if (steChoice.equals("countries") || steChoice.equals("1")) {
            lstSecretWord = countries;
            selectedCategory = "ДЪРЖАВИ";
            Game.validCategory = true;
        } else if (steChoice.equals("cities") || steChoice.equals("2")) {
            lstSecretWord = cities;
            selectedCategory = "ГРАДОВЕ";
            Game.validCategory = true;
        } else if (steChoice.equals("rivers") || steChoice.equals("3")) {
            lstSecretWord = rivers;
            selectedCategory = "РЕКИ";
            Game.validCategory = true;
        } else {
            Game.validCategory = false;
        }
        return lstSecretWord;
    }
}
